In [2]:
import numpy as np
import pandas as pd

## Pandas Series

In [14]:
pd.Series()

Series([], dtype: object)

In [15]:
X = pd.Series( ['A','B','C'])
Y = pd.Series(X)
print(Y, type(Y))

0    A
1    B
2    C
dtype: object <class 'pandas.core.series.Series'>

In [16]:
X.name = 'My letters'
X

0    A
1    B
2    C
Name: My letters, dtype: object

In [17]:
X = pd.Series(['A','B','C'])
index_names = ['first', 'second', 'third']

X.index = index_names
X

first     A
second    B
third     C
dtype: object

In [25]:
#Given the X pandas Series, show its first element
X.iloc[0]

'A'

In [23]:
#Given the X pandas Series, show its last element
X[-1]

C:\Users\User\AppData\Local\Temp\ipykernel_18632\1113154685.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  X[-1]

'C'

In [21]:
#Given the X pandas Series, show all middle elements
X[1:-1]

second    B
dtype: object

In [22]:
#Given the X pandas Series, show the elements in reverse position
X[::-1]

third     C
second    B
first     A
dtype: object

In [26]:
#Given the X pandas Series, show the first and last elements
X.iloc[[0, -1]]

first    A
third    C
dtype: object

In [36]:
#Convert the given integer pandas Series to float

X = pd.Series([1,2,3,4,5],
              index=['first','second','third','forth','fifth'])

pd.Series(X, dtype=float)

first     1.0
second    2.0
third     3.0
forth     4.0
fifth     5.0
dtype: float64

In [38]:
# X = pd.to_numeric(X, errors = 'coerce')
X = X.astype(float)
X

first     1.0
second    2.0
third     3.0
forth     4.0
fifth     5.0
dtype: float64

In [46]:
certificates_earned = pd.Series(
    [8, 2, 5, 6],
    index=['Tom', 'Kris', 'Ahmad', 'Beau']
)

print(certificates_earned)

Tom      8
Kris     2
Ahmad    5
Beau     6
dtype: int64

In [45]:
#Reverse the given pandas Series (first element becomes last)

certificates_earned[::-1]
certificates_earned = certificates_earned.sort_values()
certificates_earned

Kris     2
Ahmad    5
Beau     6
Tom      8
dtype: int64

In [50]:
#Given the X pandas Series, set the fifth element equal to 10
certificates_earned[2] = 10
certificates_earned

C:\Users\User\AppData\Local\Temp\ipykernel_18632\1785706610.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  certificates_earned[2] = 10

Tom       8
Kris      2
Ahmad    10
Beau      6
dtype: int64

In [53]:
#Given the X pandas Series, change all the middle elements to 0
certificates_earned[1 :-1] = 0 
certificates_earned

Tom      8
Kris     0
Ahmad    0
Beau     6
dtype: int64

In [57]:
#Given the X pandas Series, make a mask showing negative elements
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])

mask = X <= 0
mask

0     True
1    False
2     True
3     True
4    False
5    False
6     True
7     True
8     True
9    False
dtype: bool

In [59]:
#Given the X pandas Series, get the negative elements

X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])

mask = X <= 0
X[mask]

0   -1
2    0
3   -4
6    0
7    0
8   -9
dtype: int64

In [61]:
#Given the X pandas Series, get numbers higher than the elements mean
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])

mask = X > X.mean()
X[mask]

1     2
4     5
5     6
9    10
dtype: int64

In [63]:
#Given the X pandas Series, get numbers equal to 2 or 10
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])

mask = (X == 2) | (X == 10)
X[mask]

1     2
9    10
dtype: int64

## DataFramme

In [66]:
data = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'])

In [67]:
data

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [70]:
data.index =  [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]
data

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [71]:
data.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [72]:
data.shape

(7, 5)

In [74]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [76]:
data.dtypes.value_counts()

float64    2
int64      2
object     1
Name: count, dtype: int64

In [87]:
data.loc['France'] , data.iloc[1]

(Population       63.951
 GDP             2833687
 Surface Area     640679
 HDI               0.888
 Continent        Europe
 Name: France, dtype: object,
 Population       63.951
 GDP             2833687
 Surface Area     640679
 HDI               0.888
 Continent        Europe
 Name: France, dtype: object)

In [88]:
data['Population'].to_frame()

                Population
Canada              35.467
France              63.951
Germany             80.940
Italy               60.665
Japan              127.061
United Kingdom      64.511
United States      318.523

In [99]:
data[1:3] # = data.loc['France': 'Germany'])

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [100]:
data.loc['France': 'Italy', ['Population', 'GDP']] #= df.iloc[1:3, [3, 5]]

         Population      GDP
France       63.951  2833687
Germany      80.940  3874437
Italy        60.665  2167744

In [103]:
data.iloc[1:4, [3, 4]]

           HDI Continent
France   0.888    Europe
Germany  0.916    Europe
Italy    0.873    Europe